---
kind: method
id: M:Autodesk.Revit.DB.CurveArray.#ctor
source: html/8017fa64-50cf-fc28-84aa-9c431183a833.htm
---
# Autodesk.Revit.DB.CurveArray.#ctor Method

Initializes a new instance of the CurveArray class

## Syntax (C#)
```csharp
public CurveArray()
```